Revit 2027 API
Document.GetPaintedMaterial Method
 Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetPaintedMaterial(
	ElementId elementId,
	Face face
)
Public Function GetPaintedMaterial (
	elementId As ElementId,
	face As Face
) As ElementId
public:
ElementId^ GetPaintedMaterial(
	ElementId^ elementId,
	Face^ face
)
member GetPaintedMaterial :
        elementId : ElementId *
        face : Face -> ElementId
Parameters
elementId ElementId
 The element that the face belongs to.
face Face
 The painted element's face.
Return Value
ElementId
 The material's Id painted on the element's face.
Exceptions
Exception | Condition
ArgumentException |  The element elementId does not exist in the document -or- The face doesn't belong to the element
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace